mindThomas/STM32-libraries/Drivers/LCD/Adafruit_SPITFT.cpp
                    if(*(SERCOM **)_spi == &sercom0) {
                        dmac_id  = SERCOM0_DMAC_ID_TX;
                        data_reg = &SERCOM0->SPI.DATA.reg;
#if defined SERCOM1
                    } else if(*(SERCOM **)_spi == &sercom1) {
                        dmac_id  = SERCOM1_DMAC_ID_TX;
                        data_reg = &SERCOM1->SPI.DATA.reg;
#endif
#if defined SERCOM2
                    } else if(*(SERCOM **)_spi == &sercom2) {
                        dmac_id  = SERCOM2_DMAC_ID_TX;
                        data_reg = &SERCOM2->SPI.DATA.reg;
#endif
#if defined SERCOM3
                    } else if(*(SERCOM **)_spi == &sercom3) {
                        dmac_id  = SERCOM3_DMAC_ID_TX;
                        data_reg = &SERCOM3->SPI.DATA.reg;
#endif
#if defined SERCOM4
                    } else if(*(SERCOM **)_spi == &sercom4) {
                        dmac_id  = SERCOM4_DMAC_ID_TX;
                        data_reg = &SERCOM4->SPI.DATA.reg;
#endif
#if defined SERCOM5
                    } else if(*(SERCOM **)_spi == &sercom5) {
                        dmac_id  = SERCOM5_DMAC_ID_TX;
                        data_reg = &SERCOM5->SPI.DATA.reg;
#endif
                    }

                    dma.setPriority(DMA_PRIORITY_3);
                    dma.setTrigger(dmac_id);
                    dma.setAction(DMA_TRIGGER_ACTON_BEAT);

                    // Initialize descriptor list.
                    for(int d=0; d<numDescriptors; d++) {
                        // No need to set SRCADDR, DESCADDR or BTCNT --
                        // those are done in the pixel-writing functions.
                        descriptor[d].BTCTRL.bit.VALID    = true;
                        descriptor[d].BTCTRL.bit.EVOSEL   =
                          DMA_EVENT_OUTPUT_DISABLE;
                        descriptor[d].BTCTRL.bit.BLOCKACT =
                           DMA_BLOCK_ACTION_NOACT;
                        descriptor[d].BTCTRL.bit.BEATSIZE = DMA_BEAT_SIZE_BYTE;
                        descriptor[d].BTCTRL.bit.DSTINC   = 0;
                        descriptor[d].BTCTRL.bit.STEPSEL  = DMA_STEPSEL_SRC;
                        descriptor[d].BTCTRL.bit.STEPSIZE =
                          DMA_ADDRESS_INCREMENT_STEP_SIZE_1;
                        descriptor[d].DSTADDR.reg         = (uint32_t)data_reg;
                    }
                    lastFillColor = 0x0000;
                    lastFillLen   = 0;
                    dma.setCallback(dma_callback);
                    return; // Success!
                }
                // Else some alloc/init error along the way...clean up...
                free(pixelBuf[0]);
                pixelBuf[0] = pixelBuf[1] = NULL;
            }
            // Don't currently have a descriptor delete function in
            // ZeroDMA lib, but if we did, it would be called here.
        }
        dma.free(); // Deallocate DMA channel
    }
#endif // end DMA init
}

/**************************************************************************/
/*!
    @brief   Read one byte from SPI interface (hardware or software)
    @returns One byte, MSB order
*/
/**************************************************************************/
uint8_t Adafruit_SPITFT::spiRead() {
	return HSPI_READ();
}

/**************************************************************************/
/*!
    @brief   Write one byte to SPI interface (hardware or software)
    @param  b  One byte to send, MSB order
*/
/**************************************************************************/
void Adafruit_SPITFT::spiWrite(uint8_t b) {
	HSPI_WRITE(b);
}


/*
 * Transaction API
 * */

/**************************************************************************/
/*!
    @brief   Begin an SPI transaction & set CS low.
*/
/**************************************************************************/
void inline Adafruit_SPITFT::startWrite(void){
    SPI_BEGIN_TRANSACTION();
    SPI_CS_LOW();
}

/**************************************************************************/
/*!
    @brief   Begin an SPI transaction & set CS high.
*/
/**************************************************************************/
void inline Adafruit_SPITFT::endWrite(void){
    SPI_CS_HIGH();
    SPI_END_TRANSACTION();
}

/**************************************************************************/
/*!
    @brief   Write a command byte (must have a transaction in progress)
    @param   cmd  The 8-bit command to send
*/
/**************************************************************************/
void Adafruit_SPITFT::writeCommand(uint8_t cmd){
    SPI_DC_LOW();
    spiWrite(cmd);
    SPI_DC_HIGH();
}

/**************************************************************************/
/*!
    @brief   Push a 2-byte color to the framebuffer RAM, will start transaction
    @param    color 16-bit 5-6-5 Color to draw
*/
/**************************************************************************/
void Adafruit_SPITFT::pushColor(uint16_t color) {
  startWrite();
  SPI_WRITE16(color);
  endWrite();
}

/**************************************************************************/
/*!
    @brief  Blit multiple 2-byte colors (must have a transaction in progress)
    @param  colors  Array of 16-bit 5-6-5 Colors to draw
    @param  len     How many pixels to draw - 2 bytes per pixel!
*/
/**************************************************************************/
void Adafruit_SPITFT::writePixels(uint16_t *colors, uint32_t len) {
#ifdef USE_SPI_DMA
    if(_sclk < 0) { // using hardware SPI?
        int     maxSpan     = maxFillLen / 2; // One scanline max
        uint8_t pixelBufIdx = 0;              // Active pixel buffer number
        while(len) {
            int count = (len < maxSpan) ? len : maxSpan;

            // Because TFT and SAMD endianisms are different, must swap bytes
            // from the 'colors' array passed into a DMA working buffer. This
            // can take place while the prior DMA transfer is in progress,
            // hence the need for two pixelBufs.
            for(int i=0; i<count; i++) {
                pixelBuf[pixelBufIdx][i] = __builtin_bswap16(*colors++);
            }
            // The transfers themselves are relatively small, so we don't
            // need a long descriptor list. We just alternate between the
            // first two, sharing pixelBufIdx for that purpose.
            descriptor[pixelBufIdx].SRCADDR.reg       =
              (uint32_t)pixelBuf[pixelBufIdx] + count * 2;
            descriptor[pixelBufIdx].BTCTRL.bit.SRCINC = 1;
            descriptor[pixelBufIdx].BTCNT.reg         = count * 2;
            descriptor[pixelBufIdx].DESCADDR.reg      = 0;

            while(dma_busy); // wait for prior line to complete

            // Move new descriptor into place...
            memcpy(dptr, &descriptor[pixelBufIdx], sizeof(DmacDescriptor));
            dma_busy = true;
            dma.startJob();                // Trigger SPI DMA transfer
            pixelBufIdx = 1 - pixelBufIdx; // Swap DMA pixel buffers

            len -= count;
        }
        lastFillColor = 0x0000; // pixelBuf has been sullied
        lastFillLen   = 0;
        while(dma_busy);        // Wait for last line to complete
#ifdef __SAMD51__
        _spi->setDataMode(SPI_MODE0); // See note in writeColor()
#endif
        return;
    }
#else
    SPI_WRITE_PIXELS((uint8_t*)colors , len * 2);
#endif
}

/**************************************************************************/
/*!
    @brief  Blit a 2-byte color many times (must have a transaction in progress)
    @param  color  The 16-bit 5-6-5 Color to draw
    @param  len    How many pixels to draw
*/
/**************************************************************************/
void Adafruit_SPITFT::writeColor(uint16_t color, uint32_t len) {

    if(!len) return; // Avoid 0-byte transfers

